Revit 2026 API

# ProgressChangedEventArgs Properties

---

The ProgressChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Caption | The text from the progress bar caption that describes the operation in progress |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | LowerRange | Lower part of progress bar range - always zero |
|  | Position | Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged" |
|  | Stage | The current stage of the progress bar |
|  | UpperRange | Upper part of progress bar range - will be any non-zero number |

#### Reference

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace